In [48]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [49]:
%%sql
sqlite://

"""1. Insérer les avions suivants dans la table Avion : (100, AIRBUS, 300, RABAT),
(101,B737,250,CASA), (101, B737,220,RABAT)
"""

In [50]:
%%sql
CREATE TABLE Avion(NA INTEGER PRIMARY KEY, Nom TEXT(12), Capacite INTEGER, Localite TEXT(10));

 * sqlite://
Done.

[]

In [51]:
%%sql
CREATE Table Pilote (
    NP INTEGER PRIMARY KEY,
    Nom TEXT(25),
    Adresse TEXT(40) )

 * sqlite://
Done.

[]

In [52]:
%%sql
CREATE Table Vol (
    NV TEXT(6),
    NP INTEGER,
    NA INTEGER,
    VD TEXT(10),
    VA TEXT(10),
    HD INTEGER,
    HA INTEGER )

 * sqlite://
Done.

[]

In [53]:
%%sql
INSERT INTO Avion VALUES(100, "AIRBUS", 300, "RABAT");
INSERT INTO Avion VALUES(101, "B737", 250, "CASA");

 * sqlite://
1 rows affected.
1 rows affected.

[]

In [54]:
%%sql
INSERT INTO Avion VALUES(102, "B737",220, "RABAT");

 * sqlite://
1 rows affected.

[]

#2.Afficher tous les avions

In [55]:
%%sql
SELECT * FROM Avion

 * sqlite://
Done.

[(100, 'AIRBUS', 300, 'RABAT'),
 (101, 'B737', 250, 'CASA'),
 (102, 'B737', 220, 'RABAT')]

#3.Afficher tous les avions par ordre croissant sur le nom

In [56]:
%%sql
SELECT * FROM Avion ORDER BY Nom

 * sqlite://
Done.

[(100, 'AIRBUS', 300, 'RABAT'),
 (101, 'B737', 250, 'CASA'),
 (102, 'B737', 220, 'RABAT')]

#4. Afficher les noms et les capacités des avions

In [57]:
%%sql
SELECT Nom, Capacite FROM Avion

 * sqlite://
Done.

[('AIRBUS', 300), ('B737', 250), ('B737', 220)]

#5. Afficher les localités des avions sans redondance

In [58]:
%%sql
SELECT DISTINCT Localite FROM Avion

 * sqlite://
Done.

[('RABAT',), ('CASA',)]

#6. Afficher les avions dans la localité et Rabat ou Casa

In [59]:
%%sql
SELECT * FROM Avion WHERE Localite ='Rabat' or Localite ='Casa';

 * sqlite://
Done.

[]

In [60]:
%%sql
SELECT * FROM Avion WHERE Localite IN('Rabat','Casa');

 * sqlite://
Done.

[]

#7.Modifier la capacité de l’avion numéro 101, la nouvelle capacité et 220

In [61]:
%%sql
UPDATE Avion SET Capacite="220" WHERE NA=101

 * sqlite://
1 rows affected.

[]

In [62]:
%%sql
SELECT * FROM Avion

 * sqlite://
Done.

[(100, 'AIRBUS', 300, 'RABAT'),
 (101, 'B737', 220, 'CASA'),
 (102, 'B737', 220, 'RABAT')]

#8. Supprimer les avions dans la capacité et inférieure à 200

In [63]:
%%sql
DELETE FROM Avion WHERE Localite < 200

 * sqlite://
0 rows affected.

[]

In [64]:
%%sql
SELECT * FROM Avion

 * sqlite://
Done.

[(100, 'AIRBUS', 300, 'RABAT'),
 (101, 'B737', 220, 'CASA'),
 (102, 'B737', 220, 'RABAT')]

#9. Afficher la capacité maximale, minimale, moyenne des avions

In [65]:
%%sql
SELECT MAX(Capacite),MIN(Capacite),AVG(Capacite) FROM Avion

 * sqlite://
Done.

[(300, 220, 246.66666666666666)]

#10.Afficher les données des avions dont la capacité est la plus basse

In [66]:
%%sql
SELECT * FROM Avion WHERE Capacite= (SELECT MIN(Capacite) FROM Avion)

 * sqlite://
Done.

[(101, 'B737', 220, 'CASA'), (102, 'B737', 220, 'RABAT')]

#11. Afficher les données des avions dont la capacité est supérieure à la capacité
moyenne 12) Afficher le nom et l’adresse des pilotes assurant les vols IT100
et IT104

In [72]:
%%sql
SELECT * FROM Avion WHERE Capacite > (SELECT AVG(Capacite) FROM Avion);

 * sqlite://
Done.

[(100, 'AIRBUS', 300, 'RABAT')]

In [31]:
%%sql
SELECT * FROM Pilote

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

#12.Afficher les numéros des pilotes qui sont en service

In [32]:
%%sql
SELECT NP FROM Pilote

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

#12.Afficher les numéros des pilotes qui sont en service

In [74]:
%%sql
SELECT NP,HD,HA,Nom FROM Pilote,Vol WHERE Pilote.NP = Vol.NP;

 * sqlite://
(sqlite3.OperationalError) ambiguous column name: NP
[SQL: SELECT NP,HD,HA,Nom FROM Pilote,Vol WHERE Pilote.NP = Vol.NP;]
(Background on this error at: http://sqlalche.me/e/e3q8)

#13.Afficher les numéros des pilotes qui ne sont pas en servic